Учебные проекты2/Виртуальные таблицы регистров/DataProcessors/УстановкаЦенПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>УстановкаЦенПродажи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Учебные проекты2/Виртуальные таблицы регистров/InformationRegisters/ЦеныПродажиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Учебные проекты2/Виртуальные таблицы регистров/DataProcessors/УстановкаЦенПродажи/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьНаСервере(ВсяНоменклатураКОбработке)
	Для Каждого Номенклатура Из ВсяНоменклатураКОбработке Цикл
		МененджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
		МененджерЗаписи.Номенклатура = Номенклатура;
		МененджерЗаписи.Период = ТекущаяДата();
		МененджерЗаписи.Цена = ФиксированнаяЦена;
		МененджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьЦенуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантУстановкиПриИзменении(Элемент)
	Элементы.ФиксированнаяЦена.Доступность = (ВариантУстановки = 0);
	Элементы.ПроцентОтТекущейЦены.Доступность = (ВариантУстановки = 2);
КонецПроцедуры


&НаСервере
Процедура УстановитьЦенуНаСервере()
	
	ВсяНоменклатураКОбработке = НоменклатураКОбработке();
	Если ВариантУстановки = 0 Тогда
		УстановитьНаСервере(ВсяНоменклатураКОбработке);
	ИначеЕсли ВариантУстановки = 1 Тогда
		УдалитьЦеныНоменклатуры(ВсяНоменклатураКОбработке);
	ИначеЕсли ВариантУстановки = 2 Тогда
		УстановитьЦеныНоменклатурыПроцентом(ВсяНоменклатураКОбработке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЦеныНоменклатуры(ВсяНоменклатураКОбработке)
	
	Для Каждого Номенклатура Из ВсяНоменклатураКОбработке Цикл
		
		НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ФиксированнаяЦена.Доступность = (ВариантУстановки = 0);
	Элементы.ПроцентОтТекущейЦены.Доступность = (ВариантУстановки = 2);
КонецПроцедуры   


&НаСервере
Процедура УстановитьЦеныНоменклатурыПроцентом(ВсяНоменклатураКОбработке)
	
	Для Каждого Номенклатура Из ВсяНоменклатураКОбработке Цикл
		
		ПоследняяЦена = ПолучитьПоследнююЦенуНоменклатуры(Номенклатура);
		Если ПоследняяЦена = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяЦена = ПоследняяЦена * (1 + ПроцентОтТекущейЦены / 100); 
		
		УстановитьНовуюЦенуНоменклатуры(Номенклатура, НоваяЦена);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююЦенуНоменклатуры(Номенклатура)

	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	ПоследняяЦена = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(, Отбор);
	
	Возврат ПоследняяЦена.Цена;
	
КонецФункции

&НаСервере
Процедура УстановитьНовуюЦенуНоменклатуры(Номенклатура, Цена)
	
	МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Цена = Цена;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры  

&НаСервере
Функция НоменклатураКОбработке()
	
	ВсяНоменклатураКОбработке = Новый Массив;
	Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
		
		НоменклатураВСтроке = СтрокаСписка.Номенклатура;
		Если НоменклатураВСтроке.ЭтоГруппа Тогда
			ДополнитьМассивЭлементамиВложеннымиВГруппу(НоменклатураВСтроке, ВсяНоменклатураКОбработке);
		Иначе
			ВсяНоменклатураКОбработке.Добавить(НоменклатураВСтроке);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВсяНоменклатураКОбработке;
	
КонецФункции

Процедура ДополнитьМассивЭлементамиВложеннымиВГруппу(ГруппаНоменклатуры, ВсяНоменклатураКОбработке)
	
	Выборка = Справочники.Номенклатура.Выбрать(ГруппаНоменклатуры); 
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда 
			ДополнитьМассивЭлементамиВложеннымиВГруппу(Выборка.Ссылка, ВсяНоменклатураКОбработке); 
		Иначе
			ВсяНоменклатураКОбработке.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.СписокНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Номенклатура", ВыбранноеЗначение);
	
	СтрокиТаблицы = СписокНоменклатуры.НайтиСтроки(ОтборСтрок);
	Если СтрокиТаблицы.Количество () > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = СписокНоменклатуры.Добавить();
	НоваяСтрока.Номенклатура = ВыбранноеЗначение;
	
КонецПроцедуры
